#### Terraform working directory 🏠: `demo/demo-account/network/security-group`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security-group.module.sgs["sgZabbixAgent"].aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "sgZabbixAgent"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sgZabbixAgent"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "sgZabbixAgent"
        }
      + tags_all               = {
          + "Name" = "sgZabbixAgent"
        }
      + vpc_id                 = "vpc-0c0c925bacfdab0d1"
    }

  # module.security-group.module.sgs["sgZabbixServer"].aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "sgZabbixServer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sgZabbixServer"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "sgZabbixServer"
        }
      + tags_all               = {
          + "Name" = "sgZabbixServer"
        }
      + vpc_id                 = "vpc-0c0c925bacfdab0d1"
    }

  # module.security-group.module.sg_rules["sgZabbixAgent"].module.egress["to-zabbix-server"].aws_security_group_rule.sg["sgZabbixServer_tcp_10051_10051"] will be created
  + resource "aws_security_group_rule" "sg" {
      + description              = "Allow access from Zabbix agents"
      + from_port                = 10051
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sgZabbixServer"
      + to_port                  = 10051
      + type                     = "egress"
    }

  # module.security-group.module.sg_rules["sgZabbixAgent"].module.ingress["zabbix-server-inbound"].aws_security_group_rule.sg["sgZabbixServer_tcp_10050_10050"] will be created
  + resource "aws_security_group_rule" "sg" {
      + description              = "Allow access from Zabbix servers"
      + from_port                = 10050
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sgZabbixServer"
      + to_port                  = 10050
      + type                     = "ingress"
    }

  # module.security-group.module.sg_rules["sgZabbixServer"].module.egress["allow-outbound"].aws_security_group_rule.cidr["0.0.0.0/0_-1_-1_-1"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.security-group.module.sg_rules["sgZabbixServer"].module.ingress["zabbix-agent-inbound"].aws_security_group_rule.sg["sgZabbixServer_tcp_10051_10051"] will be created
  + resource "aws_security_group_rule" "sg" {
      + description              = "Allow access from Zabbix agents"
      + from_port                = 10051
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sgZabbixServer"
      + to_port                  = 10051
      + type                     = "ingress"
    }

  # module.security-group.module.sg_rules["sgZabbixServer"].module.ingress["zabbix-ui-access"].aws_security_group_rule.cidr["0.0.0.0/0_tcp_443_443"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
